docs: improve architecture diagram
